# __author__ = 'Екомасова Ксения Алексеевна'

import math
# Задание-1:
# Ваня набрал несколько операций в интерпретаторе и получал результаты:
# 	Код: a == a**2
# 	Результат: True
# 	Код: a == a*2
# 	Результат: True
# 	Код: a > 999999
# 	Результат: True

# Вопрос: Чему была равна переменная a,
# если точно известно, что её значение не изменялось?

# Подсказка: это значение точно есть ;)

#работает правило: всё, что не 0 и не пустота, является правдой.
#я думаю, что можно сделать через math, но не нашла :(

